app/controllers/features_controller.rb

SELECT * FROM "packages" WHERE ("packages"."id" = 1)
---
  def index
    @package = Platter::Package.find(params[:package_id])

SELECT * FROM "packages" WHERE ("packages"."id" = 1)
INSERT INTO "features" ("package_id", "created_at", "title", "updated_at") VALUES(1, '2009-09-14 03:08:19.093481', E'Second Feature', '2009-09-14 03:08:19.093481') RETURNING "id"
---
  def create
    @feature = Platter::Feature.new(params[:feature])
    @feature.package = Platter::Package.find(params[:package_id])
    @feature.save!

SELECT * FROM "features" WHERE ("features"."id" = 1)
---
  def shrink
    @feature = Platter::Feature.find(params[:id])

SELECT * FROM "features" WHERE ("features"."id" = 1)
---
  def show
    @feature = Platter::Feature.find(params[:id])

SELECT * FROM "features" WHERE ("features"."id" = 1)
---
  def edit
    @feature = Platter::Feature.find(params[:id])

SELECT * FROM "features" WHERE ("features"."id" = 1)
UPDATE "features" SET "updated_at" = '2009-09-14 02:35:02.134452', "title" = E'First Edited Feature' WHERE "id" = 1
---
  def update
    puts "params[:commit]: #{params[:commit]}"
    if params[:commit] == "Update"
      @feature = Platter::Feature.find(params[:id])
      @feature.update_attributes!(params[:feature])