app/controllers/features_controller.rb

  def new
    @package = Platter::Package.find(params[:package_id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 1)