app/controllers/features_controller.rb

  def index
    @count = Platter::Feature.count
---
SELECT * FROM "features" WHERE ("features".package_id = 1)