app/controllers/lines_controller.rb

  def new
    @feature = Platter::Feature.find(params[:feature_id])
---
SELECT * FROM "features" WHERE ("features"."id" = 1)

  def create
    @line = Platter::FeatureLine.new(params[:line])
    @line.feature = Platter::Feature.find(params[:feature_id])
    @line.save!
---
SELECT * FROM "feature_lines" WHERE (feature_id = 1) ORDER BY position DESC LIMIT 1
SELECT * FROM "features" WHERE ("features"."id" = 1)
INSERT INTO "feature_lines" ("position", "created_at", "updated_at", "text", "feature_id") VALUES(1, '2009-09-14 03:15:22.845481', '2009-09-14 03:15:22.845481', E'First Line', 1) RETURNING "id"

  def edit
    @line = Platter::FeatureLine.find(params[:id])
---
SELECT * FROM "feature_lines" WHERE ("feature_lines"."id" = 1)

  def update
    if params[:commit] == "Update"
      @line = Platter::FeatureLine.find(params[:id])
      @line.update_attributes!(params[:line])
---
SELECT * FROM "feature_lines" WHERE ("feature_lines"."id" = 1)
UPDATE "feature_lines" SET "updated_at" = '2009-09-14 03:15:28.790481', "text" = E'First Updated Line' WHERE "id" = 1

  def destroy
    @line = Platter::FeatureLine.find(params[:id])
    @line.destroy
---
SELECT * FROM "feature_lines" WHERE ("feature_lines"."id" = 1)
DELETE FROM "feature_lines" WHERE "id" = 1