app/controllers/packages_controller.rb

INSERT INTO "packages" ("name", "parent_id") VALUES(E'First Package', NULL) RETURNING "id"
---
  def create
    establish_parent
    @package = Platter::Package.new(params[:package].merge(:parent => @parent))
    @package.save!

SELECT * FROM "packages" WHERE ("packages".parent_id = 1) ORDER BY name
---
  def show
    @package = Platter::Package.find(params[:id])