app/controllers/scenarios_controller.rb

SELECT * FROM "features" WHERE ("features"."id" = 1)
---
  def new
    @feature = Platter::Feature.find(params[:feature_id])

SELECT * FROM "features" WHERE ("features"."id" = 1)
SELECT * FROM "scenarios" WHERE (feature_id = 1) ORDER BY position DESC LIMIT 1
INSERT INTO "scenarios" ("position", "created_at", "title", "updated_at", "feature_id") VALUES(1, '2009-09-14 03:15:46.914481', E'First Scenario', '2009-09-14 03:15:46.914481', 1) RETURNING "id"
---
  def create
    @scenario = Platter::Scenario.new(params[:scenario])
    @scenario.feature = Platter::Feature.find(params[:feature_id])
    @scenario.save!