app/controllers/steps_controller.rb

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)
---
  def new
    @scenario = Platter::Scenario.find(params[:scenario_id])

SELECT * FROM "scenarios" WHERE ("scenarios"."id" = 1)
SELECT * FROM "steps" WHERE (scenario_id = 1) ORDER BY position DESC LIMIT 1
INSERT INTO "steps" ("position", "scenario_id", "created_at", "updated_at", "text") VALUES(1, 1, '2009-09-14 03:23:35.946481', '2009-09-14 03:23:35.946481', E'First Step') RETURNING "id"
---
  def create
    @step = Platter::Step.new(params[:step])
    @step.scenario = Platter::Scenario.find(params[:scenario_id])
    @step.save!

SELECT * FROM "steps" WHERE ("steps"."id" = 1)
---
  def edit
    @step = Platter::Step.find(params[:id])

SELECT * FROM "steps" WHERE ("steps"."id" = 1)
UPDATE "steps" SET "updated_at" = '2009-09-14 03:23:40.039481', "text" = E'First Updated Step' WHERE "id" = 1
---
  def update
    if params[:commit] == "Update"
      @step = Platter::Step.find(params[:id])
      if !@step.update_attributes(params[:step])

SELECT * FROM "steps" WHERE ("steps"."id" = 1)
DELETE FROM "steps" WHERE "id" = 1
---
  def destroy
    @step = Platter::Step.find(params[:id])
    @step.destroy